# Задача_1. Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

number = 10

person_name = 'Kate'

name = input('Введите имя: ')
surname = input("Введите фамилию: ")
age = int(input('Введите возраст: '))

print(number)
print(person_name)
print(surname, name, age)


